Repository: songlabs/PanPanCamera
Catalog: PanPanCamera/Resources/Localization/Localizable.xcstrings
Source language: ja
Languages: en, ko, zh_hans, zh_hant

# camera.photosProcessing
source: 写真を処理中です。しばらくお待ちください
en: Processing photos. Please wait.
ko: 사진 처리 중입니다. 잠시만 기다려 주세요.
zh_hans: 照片处理中，请稍后
zh_hant: 照片處理中，請稍候

# camera.processingFailed
source: 写真を処理できませんでした。もう一度撮影してください
en: The photo could not be processed. Please take another photo.
ko: 사진을 처리하지 못했습니다. 다시 촬영해 주세요.
zh_hans: 照片处理失败，请重新拍摄
zh_hant: 照片處理失敗，請重新拍攝

# camera.saveFailed
source: 写真を保存できませんでした。写真へのアクセス許可と空き容量を確認してください
en: The photo could not be saved. Check Photos access and available storage.
ko: 사진을 저장하지 못했습니다. 사진 접근 권한과 저장 공간을 확인해 주세요.
zh_hans: 照片保存失败，请检查照片访问权限和可用空间
zh_hant: 照片儲存失敗，請檢查照片存取權限和可用空間

# action.backToCamera
source: カメラに戻る
en: Back to camera
ko: 카메라로 돌아가기
zh_hans: 返回相机
zh_hant: 返回相機

# action.close
source: 閉じる
en: Close
ko: 닫기
zh_hans: 关闭
zh_hant: 關閉

# action.retry
source: 再試行
en: Try again
ko: 다시 시도
zh_hans: 重试
zh_hant: 再試一次

# album.detail
source: アルバムの読み込みと保存は未実装です。このバージョンは写真ライブラリへのアクセスを要求しません。
en: Album import and saving are not implemented yet. This version does not request photo library access.
ko: 앨범 불러오기와 저장은 아직 지원하지 않아요. 현재 버전은 사진 보관함 접근 권한을 요청하지 않아요.
zh_hans: 相册导入和保存尚未实现。当前版本不会请求照片图库权限。
zh_hant: 相簿匯入與儲存尚未實作。目前版本不會要求照片圖庫權限。

# beauty.auto
source: 自動
en: Auto
ko: 자동
zh_hans: 自动

# beauty.category
source: 補正の種類
en: Adjustment category
ko: 보정 종류
zh_hans: 调整类别
zh_hant: 調整類別

# beauty.face
source: 顔補正
en: Reshape
ko: 얼굴 보정
zh_hans: 美型
zh_hant: 美型

# beauty.face.overallDetail
source: 5つの顔補正の強さを一括調整 · プレビューのみ
en: Scale all five reshape effects · Preview only
ko: 다섯 가지 얼굴 보정 강도 조절 · 미리보기만
zh_hans: 统一调节五项美型强度 · 仅预览
zh_hant: 統一調節五項美型強度 · 僅預覽

# beauty.face.overallRange
source: 0% 補正なし · 100% 各項目の設定どおりの強さ
en: 0% off · 100% full strength at each setting
ko: 0% 보정 없음 · 100% 각 항목의 설정 강도 그대로
zh_hans: 0% 不调整 · 100% 按各项设定全强度应用
zh_hant: 0% 不調整 · 100% 按各項設定全強度套用

# beauty.face.strengthRange
source: 強さ：0% 補正なし · 100% 最大（全体の強さに連動）
en: Strength: 0% off · 100% max, scaled by Overall
ko: 강도: 0% 보정 없음 · 100% 최대 (전체 강도에 비례)
zh_hans: 强度：0% 不调整 · 100% 最大（随总强度）
zh_hant: 強度：0% 不調整 · 100% 最大（隨總強度）

# beauty.face.unavailableDetail
source: この項目はまだ適用されません
en: This adjustment is not yet applied
ko: 이 항목은 아직 적용되지 않습니다
zh_hans: 此项调整尚未生效
zh_hant: 此項調整尚未生效

# beauty.intensity
source: 調整値：0〜100
en: Adjustment from 0 to 100
ko: 0부터 100까지 조절
zh_hans: 调整范围为 0 至 100
zh_hant: 調整範圍為 0 至 100

# beauty.overall
source: 全体の強さ
en: Overall
ko: 전체 강도
zh_hans: 总强度
zh_hant: 總強度

# beauty.skin
source: 美肌
en: Skin
ko: 피부

# beauty.skin.overallDetail
source: 各項目をまとめて設定し、美肌全体の強さを調整。
en: Set all skin controls together and scale their overall effect.
ko: 모든 피부 항목을 함께 설정하고 전체 강도를 조절합니다.
zh_hans: 批量设置各项，并控制美肤整体强度。
zh_hant: 批次設定各項，並控制美膚整體強度。

# beauty.skin.overallRange
source: 0% オフ · 100% 各項目の設定強度を適用
en: 0% off · 100% applies each control at its set strength
ko: 0% 끄기 · 100% 각 항목의 설정 강도 적용
zh_hans: 0% 关闭 · 100% 按各项强度应用
zh_hant: 0% 關閉 · 100% 按各項強度套用

# beauty.skin.strengthRange
source: 0% オフ · 100% 最大（全体の強さに連動）
en: 0% off · 100% maximum (scaled by overall strength)
ko: 0% 끄기 · 100% 최대 (전체 강도에 연동)
zh_hans: 0% 不处理 · 100% 最大（随总强度）
zh_hant: 0% 不處理 · 100% 最大（隨總強度）

# camera.album
source: アルバム
en: Album
ko: 앨범
zh_hans: 相册
zh_hant: 相簿

# camera.aspectRatio
source: 写真の比率
en: Aspect ratio
ko: 사진 비율
zh_hans: 画幅比例
zh_hant: 照片比例

# camera.aspectRatio.detail
source: 比率の変更は未実装です。写真はカメラ標準の比率で撮影します。全画面プレビューでは写真の周辺が一部表示されません。
en: Ratio controls are not implemented yet. Photos use the native camera ratio. The full-screen preview crops some edges; the photo keeps the full frame.
ko: 비율 변경은 아직 지원하지 않아요. 사진은 카메라 기본 비율로 촬영돼요. 전체 화면 미리보기에서는 가장자리 일부가 잘리지만 사진에는 전체 화면이 담겨요.
zh_hans: 暂不支持更改画幅。照片使用相机原生比例，全屏预览会裁去部分边缘，拍摄结果保留完整画面。
zh_hant: 尚未支援變更比例。照片使用相機原生比例，全螢幕預覽會裁去部分邊緣，拍攝結果保留完整畫面。

# camera.back
source: リアカメラ
en: Rear camera
ko: 후면 카메라
zh_hans: 后置摄像头
zh_hant: 後置鏡頭

# camera.failed
source: カメラを起動できませんでした。もう一度お試しください。
en: The camera could not start. Please try again.
ko: 카메라를 시작할 수 없어요. 다시 시도해 주세요.
zh_hans: 无法启动相机，请重试。
zh_hant: 無法啟動相機，請再試一次。

# camera.flash
source: フラッシュ
en: Flash
ko: 플래시
zh_hans: 闪光灯
zh_hant: 閃光燈

# camera.flash.auto
source: 自動
en: Auto
ko: 자동
zh_hans: 自动

# camera.flash.off
source: オフ
en: Off
ko: 끔
zh_hans: 关闭
zh_hant: 關閉

# camera.flash.on
source: オン
en: On
ko: 켬
zh_hans: 开启
zh_hant: 開啟

# camera.flash.unavailable
source: フラッシュは利用できません
en: Flash unavailable
ko: 플래시를 사용할 수 없어요
zh_hans: 当前无法使用闪光灯
zh_hant: 目前無法使用閃光燈

# camera.front
source: フロントカメラ
en: Front camera
ko: 전면 카메라
zh_hans: 前置摄像头
zh_hant: 前置鏡頭

# camera.interrupted
source: カメラが一時的に中断されています。利用可能になると再開します。
en: The camera was interrupted. Preview will resume when it becomes available.
ko: 카메라가 일시 중단되었어요. 다시 사용할 수 있게 되면 미리보기가 재개돼요.
zh_hans: 相机暂时中断，可用后将恢复预览。
zh_hant: 相機暫時中斷，可用後將恢復預覽。

# camera.livePreview
source: カメラのライブプレビュー
en: Live camera preview
ko: 실시간 카메라 미리보기
zh_hans: 相机实时预览
zh_hant: 相機即時預覽

# camera.nativeSensor
source: 現在：カメラ標準の比率
en: Current: native camera ratio
ko: 현재: 카메라 기본 비율
zh_hans: 当前：相机原生比例
zh_hant: 目前：相機原生比例

# camera.settings
source: 設定
en: Settings
ko: 설정
zh_hans: 设置

# camera.shutter
source: 写真を撮る
en: Take photo
ko: 사진 촬영
zh_hans: 拍照
zh_hant: 拍照

# camera.starting
source: カメラを起動中…
en: Starting camera…
ko: 카메라 시작 중…
zh_hans: 正在启动相机…
zh_hant: 正在啟動相機…

# camera.switch
source: カメラを切り替える
en: Switch camera
ko: 카메라 전환
zh_hans: 切换摄像头
zh_hant: 切換鏡頭

# camera.timer
source: タイマー
en: Timer
ko: 타이머
zh_hans: 定时拍摄
zh_hant: 自拍計時器

# camera.timer.detail
source: タイマー撮影は未実装です。シャッターを押すとすぐに撮影します。
en: The timer is not implemented yet. The shutter takes a photo immediately.
ko: 타이머 촬영은 아직 지원하지 않아요. 셔터를 누르면 바로 촬영해요.
zh_hans: 定时拍摄尚未实现，点击快门会立即拍照。
zh_hant: 計時拍攝尚未實作，點選快門會立即拍照。

# camera.timer.off
source: 現在：タイマーオフ
en: Current: timer off
ko: 현재: 타이머 꺼짐
zh_hans: 当前：定时拍摄关闭
zh_hant: 目前：計時器關閉

# camera.unavailable
source: カメラが見つかりません
en: No camera available
ko: 사용 가능한 카메라가 없어요
zh_hans: 未找到可用摄像头
zh_hant: 找不到可用的鏡頭

# camera.unavailable.detail
source: カメラを搭載したiPhoneでお試しください。シミュレータではカメラを利用できません。
en: Run PanPan on an iPhone with a camera. The camera is unavailable in Simulator.
ko: 카메라가 있는 iPhone에서 실행해 주세요. 시뮬레이터에서는 카메라를 사용할 수 없어요.
zh_hans: 请在配有摄像头的 iPhone 上运行，模拟器无法使用相机。
zh_hant: 請在配備鏡頭的 iPhone 上執行，模擬器無法使用相機。

# capture.image
source: 撮影した写真のプレビュー
en: Preview of your captured photo
ko: 촬영한 사진 미리보기
zh_hans: 已拍摄照片的预览
zh_hant: 已拍攝照片的預覽

# capture.memoryOnly
source: 写真ライブラリに保存しました。
en: Saved to your photo library.
ko: 사진 보관함에 저장했습니다.
zh_hans: 已保存到照片图库。
zh_hant: 已儲存到照片圖庫。

# capture.result
source: 撮影した写真
en: Your photo
ko: 촬영한 사진
zh_hans: 拍摄结果
zh_hant: 拍攝結果

# error.capture
source: 写真を撮影できませんでした。もう一度お試しください。
en: Could not capture the photo. Please try again.
ko: 사진을 촬영하지 못했어요. 다시 시도해 주세요.
zh_hans: 拍照失败，请重试。
zh_hant: 拍照失敗，請再試一次。

# error.switch
source: カメラを切り替えられませんでした。
en: Could not switch cameras.
ko: 카메라를 전환하지 못했어요.
zh_hans: 无法切换摄像头。
zh_hant: 無法切換鏡頭。

# error.title
source: カメラのお知らせ
en: Camera notice
ko: 카메라 알림
zh_hans: 相机提示
zh_hant: 相機提示

# face.cheekbones
source: 頬骨幅を狭く
en: Narrow cheekbones
ko: 광대 폭 좁히기
zh_hans: 收窄颧骨
zh_hant: 收窄顴骨

# face.cheekbones.detail
source: 頬骨付近の両側を内側へ · プレビューのみ
en: Move cheekbone areas inward · Preview only
ko: 광대 주변 양쪽을 안쪽으로 · 미리보기만
zh_hans: 颧骨附近两侧向内收窄 · 仅预览
zh_hant: 顴骨附近兩側向內收窄 · 僅預覽

# face.chin
source: あごを細く短く
en: Narrow & shorten chin
ko: 턱 좁히고 줄이기
zh_hans: 收窄并缩短下巴
zh_hant: 收窄並縮短下巴

# face.chin.detail
source: 両側を内側へ、あご先を上へ · プレビューのみ
en: Move jaw sides inward and chin tip up · Preview only
ko: 턱 양쪽은 안쪽으로, 턱끝은 위로 · 미리보기만
zh_hans: 下颌两侧内收、下巴底部上提 · 仅预览
zh_hant: 下顎兩側內收、下巴底部上提 · 僅預覽

# face.eyeHeight
source: 目の位置
en: Eye height
ko: 눈 높이
zh_hans: 眼高
zh_hant: 眼睛高度

# face.eyeSpacing
source: 目の間隔
en: Eye spacing
ko: 눈 사이 간격
zh_hans: 眼距
zh_hant: 眼距

# face.eyes.detail
source: 目の位置に合わせて、自然に少しだけ大きくします。
en: Gently enlarges the eyes using their detected positions.
ko: 감지된 눈 위치에 맞춰 눈을 자연스럽게 조금 키웁니다.
zh_hans: 根据检测到的眼睛位置，轻微自然地放大双眼。
zh_hant: 依偵測到的眼睛位置，輕微自然地放大雙眼。

# face.eyes
source: 目
en: Eye size
ko: 눈 크기
zh_hans: 大眼
zh_hant: 大眼

# face.forehead
source: 額を下げる
en: Lower forehead
ko: 이마 내리기
zh_hans: 下移额头
zh_hant: 下移額頭

# face.forehead.detail
source: 額の一部を下へ移動 · プレビューのみ
en: Move local forehead areas down · Preview only
ko: 이마 일부를 아래로 · 미리보기만
zh_hans: 额头局部向下移动 · 仅预览
zh_hant: 額頭局部向下移動 · 僅預覽

# face.mouth
source: 口
en: Mouth
ko: 입
zh_hans: 嘴部
zh_hant: 嘴部

# face.mouthShape
source: 口の形
en: Lip shape
ko: 입 모양
zh_hans: 嘴型
zh_hant: 唇形

# face.mouthWidth
source: 口幅
en: Mouth width
ko: 입 너비
zh_hans: 嘴宽
zh_hant: 嘴寬

# face.nose
source: 鼻
en: Nose
ko: 코
zh_hans: 鼻子
zh_hant: 鼻子

# face.noseLength
source: 鼻の長さ
en: Nose length
ko: 코 길이
zh_hans: 鼻长
zh_hant: 鼻長

# face.noseWidth
source: 鼻幅
en: Nose width
ko: 코 폭
zh_hans: 鼻宽
zh_hant: 鼻寬

# face.slim
source: 小顔
en: Slim face
ko: 작은 얼굴
zh_hans: 瘦脸
zh_hant: 小臉

# face.slim.detail
source: 下あごの両側を内側へ · プレビューのみ
en: Move lower jaw sides inward · Preview only
ko: 아래턱 양쪽을 안쪽으로 · 미리보기만
zh_hans: 下颌两侧向内收窄 · 仅预览
zh_hant: 下顎兩側向內收窄 · 僅預覽

# face.width
source: 顔幅を狭く
en: Narrow face
ko: 얼굴 폭 좁히기
zh_hans: 收窄脸宽
zh_hant: 收窄臉寬

# face.width.detail
source: 顔の中央付近の両側を内側へ · プレビューのみ
en: Move mid-face sides inward · Preview only
ko: 얼굴 중간 양쪽을 안쪽으로 · 미리보기만
zh_hans: 面部中段两侧向内收窄 · 仅预览
zh_hant: 臉部中段兩側向內收窄 · 僅預覽

# feature.unavailable
source: 未対応
en: Unavailable
ko: 준비 중
zh_hans: 暂不支持
zh_hant: 尚未支援

# filter.clear
source: クリア
en: Clear
ko: 맑게
zh_hans: 清透
zh_hant: 清透

# filter.clear.detail
source: 明るさを少し上げ、重い色味をやわらげます。
en: Lift brightness and soften heavy colors for a clearer look.
ko: 밝기를 조금 높이고 짙은 색감을 부드럽게 조정합니다.
zh_hans: 略微提亮并减轻过重色彩，让画面更清透。
zh_hant: 略微提亮並減輕過重色彩，讓畫面更清透。

# filter.cool
source: クール
en: Cool
ko: 시원하게
zh_hans: 冷调
zh_hant: 冷色

# filter.cool.detail
source: 青みを抑えながら、ほんのり涼しげな色合いに。
en: Add a subtle cool tone while keeping blue tones restrained.
ko: 푸른 기운은 억제하면서 은은한 차가운 색감을 더합니다.
zh_hans: 轻微增加冷色倾向，避免明显偏蓝。
zh_hant: 輕微增加冷色傾向，避免明顯偏藍。

# filter.natural
source: ナチュラル
en: Natural
ko: 내추럴
zh_hans: 自然
zh_hant: 自然

# filter.natural.detail
source: 色と明暗を控えめに整え、自然な印象に。
en: Gently balance color and contrast for a natural look.
ko: 전체 색감과 명암을 가볍게 조정해 자연스럽게 표현합니다.
zh_hans: 轻微调整整体色彩与明暗，保留自然观感。
zh_hant: 輕微調整整體色彩與明暗，保留自然觀感。

# filter.original
source: オリジナル
en: Original
ko: 원본
zh_hans: 原图
zh_hant: 原圖

# filter.original.detail
source: フィルターを加えず、現在の画像を保ちます。
en: Keep the current image without adding a filter.
ko: 현재 이미지에 필터를 추가하지 않습니다.
zh_hans: 保留当前图像，不添加滤镜。
zh_hant: 保留目前影像，不加入濾鏡。

# filter.strengthRange
source: 0% フィルターなし · 100% フル効果
en: 0% Original · 100% Full effect
ko: 0% 원본 · 100% 전체 효과
zh_hans: 0% 原图 · 100% 完整效果
zh_hant: 0% 原圖 · 100% 完整效果

# filter.title
source: フィルター
en: Filters
ko: 필터
zh_hans: 滤镜
zh_hant: 濾鏡

# filter.warm
source: ウォーム
en: Warm
ko: 따뜻하게
zh_hans: 暖调
zh_hant: 暖色

# filter.warm.detail
source: 黄みを抑えながら、ほんのり暖かい色合いに。
en: Add subtle warmth while keeping yellow tones restrained.
ko: 노란 기운은 억제하면서 은은한 따뜻함을 더합니다.
zh_hans: 轻微增加暖色倾向，避免明显偏黄。
zh_hant: 輕微增加暖色傾向，避免明顯偏黃。

# language.system
source: システム設定に従う
en: System Default
ko: 시스템 설정
zh_hans: 跟随系统
zh_hant: 跟隨系統

# makeup.blush
source: チーク
en: Blush
ko: 블러셔
zh_hans: 腮红
zh_hant: 腮紅

# makeup.blush.detail
source: 頬にやわらかな血色を加え、自然になじませます。
en: Add a soft flush to the cheeks with gently blended edges.
ko: 양 볼에 은은한 생기를 더하고 경계를 부드럽게 표현합니다.
zh_hans: 为双颊增加柔和气色，让边缘自然融入肤色。
zh_hant: 為雙頰增加柔和氣色，讓邊緣自然融入膚色。

# makeup.brow
source: アイブロウ
en: Brows
ko: 눈썹
zh_hans: 眉妆
zh_hant: 眉妝

# makeup.brow.detail
source: 眉の形と毛の質感を保ち、色を少し深めます。
en: Gently deepen brow color while preserving shape and texture.
ko: 본래 눈썹 모양과 결을 살리며 색을 조금 진하게 합니다.
zh_hans: 轻量加深眉部颜色，保留原有眉形和毛发纹理。
zh_hant: 輕量加深眉部顏色，保留原有眉形和毛髮紋理。

# makeup.eye
source: アイメイク
en: Eyes
ko: 아이 메이크업
zh_hans: 眼妆
zh_hant: 眼妝

# makeup.eye.detail
source: 目の輪郭に沿って、目元を控えめに引き立てます。
en: Gently enhance the eye area along its natural contours.
ko: 눈의 자연스러운 윤곽을 따라 눈 주변을 은은하게 강조합니다.
zh_hans: 沿眼部轮廓轻量增强眼周，保留自然眼神。
zh_hant: 沿眼部輪廓輕量增強眼周，保留自然眼神。

# makeup.lip
source: リップ
en: Lips
ko: 립
zh_hans: 唇妆
zh_hant: 唇妝

# makeup.lip.detail
source: 唇の質感と陰影を保ち、自然な血色を加えます。
en: Add natural lip color while preserving texture and shading.
ko: 입술의 질감과 명암을 살리며 자연스러운 색을 더합니다.
zh_hans: 自然调整唇部颜色，保留纹理和明暗层次。
zh_hant: 自然調整唇部顏色，保留紋理和明暗層次。

# makeup.strengthRange
source: 0% 処理なし · 100% 最大
en: 0% No effect · 100% Maximum
ko: 0% 효과 없음 · 100% 최대
zh_hans: 0% 不处理 · 100% 最大
zh_hant: 0% 不處理 · 100% 最大

# makeup.title
source: メイク
en: Makeup
ko: 메이크업
zh_hans: 美妆
zh_hant: 美妝

# mode.photo
source: 写真
en: Photo
ko: 사진
zh_hans: 照片
zh_hant: 照片

# mode.portrait
source: ポートレート
en: Portrait
ko: 인물
zh_hans: 人像
zh_hant: 人像

# mode.video
source: ビデオ
en: Video
ko: 동영상
zh_hans: 视频
zh_hant: 影片

# permission.detail
source: プレビューと撮影を使うには、設定でPanPanのカメラへのアクセスを許可してください。
en: Allow PanPan to access the camera in Settings to use live preview and take photos.
ko: 실시간 미리보기와 사진 촬영을 사용하려면 설정에서 PanPan의 카메라 접근을 허용해 주세요.
zh_hans: 请在系统设置中允许 PanPan 访问相机，以使用实时预览和拍照。
zh_hant: 請在系統設定中允許 PanPan 存取相機，以使用即時預覽與拍照。

# permission.openSettings
source: 設定を開く
en: Open Settings
ko: 설정 열기
zh_hans: 打开设置
zh_hant: 開啟設定

# permission.requesting
source: カメラのアクセスを確認中…
en: Checking camera access…
ko: 카메라 권한 확인 중…
zh_hans: 正在确认相机权限…
zh_hant: 正在確認相機權限…

# permission.restricted
source: このデバイスではカメラの利用が制限されています。スクリーンタイムやデバイスの管理設定をご確認ください。
en: Camera access is restricted on this device. Check Screen Time or device management settings.
ko: 이 기기에서 카메라 사용이 제한되어 있어요. 스크린 타임이나 기기 관리 설정을 확인해 주세요.
zh_hans: 此设备限制了相机使用，请检查屏幕使用时间或设备管理设置。
zh_hant: 此裝置限制了相機使用，請檢查螢幕使用時間或裝置管理設定。

# permission.title
source: カメラへのアクセスが必要です
en: Camera access is needed
ko: 카메라 접근 권한이 필요해요
zh_hans: 需要相机访问权限
zh_hant: 需要相機存取權限

# settings.language
source: 言語
en: Language
ko: 언어
zh_hans: 语言
zh_hant: 語言

# settings.privacy
source: プライバシー
en: Privacy
ko: 개인정보 보호
zh_hans: 隐私
zh_hant: 隱私

# settings.privacy.detail
source: 写真とカメラの処理はデバイス内で完結します。写真のアップロード、外部AI API、アカウント、広告、解析SDKは使用しません。
en: Photos and camera processing stay on your device. No photo uploads, external AI APIs, accounts, ads, or analytics SDKs.
ko: 사진과 카메라 처리는 모두 기기에서 이루어져요. 사진 업로드, 외부 AI API, 계정, 광고, 분석 SDK를 사용하지 않아요.
zh_hans: 照片和相机处理均在设备本地完成。不上传照片，不使用外部 AI API、账号、广告或分析 SDK。
zh_hant: 照片與相機處理均在裝置本機完成。不上傳照片，不使用外部 AI API、帳號、廣告或分析 SDK。

# settings.scope
source: バージョン0.1
en: Version 0.1
ko: 버전 0.1
zh_hans: 版本 0.1
zh_hant: 版本 0.1

# settings.scope.detail
source: 写真撮影、結果プレビュー、美肌・メイク・フィルターのリアルタイム表示と写真への適用に対応しています。小顔・顔幅・あご・おでこ・頬骨の補正はリアルタイム表示のみです。目・鼻・口の形状補正、ビデオ、ポートレート、アルバム、比率変更、タイマーは未対応です。
en: Photo capture, result preview, and live/final skin, makeup, and filter processing are implemented. Slim, face width, chin, forehead, and cheekbone adjustments apply to live preview only. Eye, nose, and mouth reshaping, video, portrait, album, ratio changes, and timer capture are unavailable.
ko: 사진 촬영, 결과 미리보기, 피부 보정·메이크업·필터의 실시간 미리보기와 사진 적용을 지원해요. 작은 얼굴, 얼굴 너비, 턱, 이마, 광대뼈 조정은 실시간 미리보기에만 적용돼요. 눈·코·입 형태 보정, 동영상, 인물 모드, 앨범, 비율 변경, 타이머 촬영은 아직 지원하지 않아요.
zh_hans: 支持拍照、结果预览，以及美肌、美妆和滤镜的实时预览与照片处理。小脸、脸宽、下巴、额头和颧骨调整仅用于实时预览。暂不支持眼、鼻、嘴的形状调整，以及视频、人像、相册、画幅更改或定时拍摄。
zh_hant: 支援拍照、結果預覽，以及美肌、美妝和濾鏡的即時預覽與相片處理。小臉、臉寬、下巴、額頭和顴骨調整僅用於即時預覽。尚未支援眼、鼻、嘴的形狀調整，以及影片、人像、相簿、比例變更或計時拍攝。

# skin.blemish
source: ニキビ
en: Blemishes
ko: 잡티
zh_hans: 祛痘
zh_hant: 祛痘

# skin.blemish.detail
source: 質感を残し、赤みのある小さなニキビ跡を和らげます。
en: Soften small reddish blemishes while retaining texture.
ko: 피부 질감을 유지하며 작고 붉은 여드름 자국을 완화합니다.
zh_hans: 局部弱化偏红的小痘印，保留肌肤纹理。
zh_hant: 局部弱化偏紅的小痘印，保留肌膚紋理。

# skin.brighten
source: 美白
en: Brighten
ko: 미백

# skin.brighten.detail
source: 顔の肌を少し明るくします。
en: Gently brighten facial skin.
ko: 얼굴 피부를 은은하게 밝힙니다.
zh_hans: 轻微提亮面部肌肤。
zh_hant: 輕微提亮臉部肌膚。

# skin.darkCircles
source: クマ
en: Dark circles
ko: 다크서클
zh_hans: 黑眼圈
zh_hant: 黑眼圈

# skin.darkCircles.detail
source: 目の下の暗さと色むらを控えめに補正します。
en: Gently reduce under-eye shadows and color differences.
ko: 눈 밑의 자연스러운 구조를 유지하며 어두움과 색 차이를 줄입니다.
zh_hans: 轻柔改善眼下暗沉与色差，保留真实结构。
zh_hant: 輕柔改善眼下暗沉與色差，保留真實結構。

# skin.smooth
source: なめらか
en: Smooth
ko: 매끈하게
zh_hans: 磨皮
zh_hant: 柔膚

# skin.smooth.detail
source: 肌の質感を残しながら、細かな凹凸を和らげます。
en: Soften small irregularities while retaining skin texture.
ko: 피부 질감을 유지하며 잔잔한 요철을 완화합니다.
zh_hans: 保留肌肤纹理，柔化细小不平整。
zh_hant: 保留肌膚紋理，柔化細小不平整。

# skin.tone
source: 肌色
en: Skin tone
ko: 피부 톤
zh_hans: 肤色
zh_hant: 膚色

# skin.tone.detail
source: 肌の局所的な色むらを自然に整えます。
en: Gently even out local skin tone differences.
ko: 국소적인 피부색 차이를 자연스럽게 완화합니다.
zh_hans: 自然减轻局部肤色色差。
zh_hant: 自然減輕局部膚色色差。
